[ 
    {"initial_area":["Gregório: Where am i? What am i doing here? Maybe im dreaming?",
        ".....",".....",
        "This is Gregórios mind.", "He is in conflict with himself because of decisions he have to make.",
        "to make piece with himself he must face these conflicts. To do that Gregório must collect 4 Conflict Stones.", 
        "Love Stone, Family Stone, Spirit Stone, Friendship Stone.", "The purple left path leads Gregório to Love Conflict Area.", 
        "The up blue path lead Gregório to the Family Conflict Area.", "The right green path lead Gregório to the Spirit Conflict Area.",
        "The down orange path lead Gregório to the Friendship Conflict Area.", 
        "Face the conflicts and get the 4 stones and come back here to make Gregório make piece with yourself.", 
        "Use WASD to move Gregório and 'F' to attack, that bar on the left upper corner is Gregório HP.", 
        "If at anytime Gregório get stuck on the dream, press the panic button on the right upper corner to reboot the dream, thanks.",
        ".....",".....",
        "Gregório: What will i find at the end of each path?"],
        
    "mind_area1":["I have been in a relationship with Giovana for so long that i don't even remember what is being single.",
        "After 8 years in a relationship, with no perspective of changes, neither long terms plans, i don't know if keeping this relationship is the best for me.",
        "I love my girlfriend. We always had a good and peaceful realtionship, but this routine that we are stuck in and lack of emotion on our relation are making me think twice if this is what i want for life.",
        "Im so young and i feel that havent had enough experiences for my age.",
        "Go to clubs with friends. Meet new girls. Will this fulfill this need that im feeling?",
        "Is it really what i want? Or we just need to talk and commit more to this relationship?"],

    "area1":["Giovana: Sniff sniff", "Giovana: I can't believe you are thinking about breaking up with me, my love! I love you so much! Don't break up with me, plesae. I promise that we will get better.",
        "Greg: How did you know that i was thinkng about that? I never said anything!",
        "Giovana: Your actions, Greg. Your actions gave you away, my love. Please, don't give up on us! We will get married, Gregório. Listen to what im saying. We will get married. Fight for our love, Greg."],
    "area1A":["Gregório received the Sword of Love, this sword is the strongest on the world of dreams.", 
        "Greg: You are right my dear. I will fight for us. I don't want leave without you.",
        "Giovana: Then come and fight for me. If you defeat me, we will be together forever!"],
    "area1AFinal":["Gregório completed the Love Conflict, Gregório received the Love Stone", 
        "Giovana: I love you, my love. We will be together forever. Im sure about it."],
    "area1B":["Gregório received the Freedom Cape, now Gregório can use dash pressing 'shift'", 
        "Giovana: You can't do this to me, Greg! I need you!",
        "Giovana: You won't escape from me, Gregório. I will find you wherever you are.",
        "Giovana: I will chase you forever, my love. I hate you for making me pass through it.",
        "Giovana: We will be happy together. I promise that we are."],
    "area1BFinal":[ "Giovana: I give up! I can't suffer for you anymore. You are right, Greg.",
        "Giovana: I can't remember the last time that we were really happy together. I think that keep trying this mistake is a dumb idea. I will leave you alone, bye Greg. Shall we meet again.",
        "Gregório completed the Love Conlifct, Gregório received the Love Stone"],
    
    "mind_area2":[" My parents always fought alot. I grew up in the middle of constants fights and ar Cresci entre suas constantes brigas e disagreements, so none of this is new to me. With time, i learned how to deal with this and leaving home probably help alot with that.",
        "Recently, things started to get worst and worst. What was weekly fights, became daily fights. No one with a safe mind could live the way that my parents are living."],

    "area2":["Mother: Gregório, your father and i talked alot and we decided that we are getting divorce. We can't take this fights anymore and we think this will be the best for everyone.",
    "Gregório: Are you serious?", "Father: Yes, son. We should have done this many years ago.", 
    "Gregório: Im glad to hear that, dad. Im happy for you guys. Honestly, i think that getting divorce is the best thing that you could do.",
    "Mother: Yes, dear. I agree with you. Now you just need to choose wich side you will take.",
    "Gregório: What? What do you mean?", "Father: You have to choose wich of us you want to keep seeing, my son. You can't have both, Gregório. Its one or another."],
    "area2A":["Father: I can't believe you did this to me, my son. I will never forgive you for that. Now face my army or die, Gregório."],
	"area2AFinal":["Gregório received the Family stone","Mother: Im glad that you chose me, my dear. Lets go, im going to make that food that you really love!"],
    "area2B":["Gregório received the Life Potion, now Gregório have more HP",
        "Mother: You can't do this to us, Gregório. How are you going to live knowing that you left your parents behind?",
        "Gregório: I wont be able to choose between you. I will never forgive you for putting me in this situation. You area all crazy.",
        "Gregório completed the Family Conflict, Gregório received the Family Stone",
        "Mother: I can't believe you did this to me, my son. I fed you, Gregório. I raised you. I will never forgive you for that. Now face my army or die, Gregório."],
    "area2BFinal":["Gregório received the Family stone", "Father: Lets drink a beer, my son. Its on me."],

    "mind_area3":["In life, not always things are so clear. Alot of times there is no right and wrong, but decisions to be made and your consenquences.",
        "Choosing the easy path is not necessarily wrong. Choosing to don't have alot of effort or problems, can spare you from alot of headache.",
        "Yes, maybe it will slow your growth and lower your strength to face the problems that appear along the path, but this doens't mean that life wont get a way to teach you.",
        "Probably taking the long path, will bring with it a bigger baggage. That indescribable feeling “I did my best and im proud of it”.",
        "There is nothing better than watching you efforts rewarded and having the feeling of duty accomplished after a long and tiring jorney. But is it worth it? Maybe saving efforts, in long terms, isn the best decision to take?"],

    "area3":["Everything in the Spirit Conflict is a little bit dark, heres a torch to help you",
        "Sometimes you can choose between the easy path or the hard path",
        "The path Gregório take, will define who he is", "Remember, theres no right choice, theres only a choice" , 
        "Wich path Gregório should choose?"],
    "area3A":["Youve chosen the easy path", "Go through the up door"],
    "area3AFinal":["Gregório received the Boots of Speed, they will make Gregório move faster", 
        "Gregório completed the Spirit Conflict, here is Gregórios prize", "Gregório received the Spirit Stone"],
    "area3B":["Youve chosen the hard path", "In this path, Gregório must enter the spirit maze and find three keys to open the door for your prize", 
        "Go through the down door"],
    "area3BFinal":["Gregório received the Time Potion, drink it and Gregório will be able to freeze time for a while, press 'E' to use its power",
        "Gregório completed the Spirit Conflict","Gregório received the Spirit Stone"],

    "mind_area4":[" Friendship is something fundamental for anyone. Friends, along with family, makes we who we are. They are the ones that are always there on the good or bad moments.",
        "However, sometimes friends lets us down. How many times i thought that i could count with someone and that person just disapointed me?",
        "Some friends are forever. Others are temporary. And other ones never been real friends.",
        "How can i know if a friendship is real? When we should be selfish and make whats best for us? When we should put our friends at first?"],
    "area4":["Jorge, the squirrel: Greg, help me, please! I have no weapon and i can't defend by myself.",
        "Gregório: But i will die if i go over there, Jorge.", 
        "Jorge, the squirrel: No, you wont. I got your back, friend. Believe me. You know that you can count on me, dont you?",
        "Protect Jorge or let him die and kill the enemies in exchange for more power?"],
    "area4A":["Gregório received the Shield of Friendship, press 'R' to use it, it makes Gregório invicible for 5 seconds, but makes Gregório slower.",
        "Gregório: God help me. Get close, Jorge. I will protect you."],
	"area4AFinal":["Gregório completed the Friendship Conflict, Gregório received the Friendship Stone.", "Thank you, my friend. I will never forget what you did for me. If you need me, just give me a call. I will be here for whatever you need."],
    "area4B":["Gregório received the Staff of Rottenness, press 'R' to use it, it fires poison balls that damages your enemy over the time.",
        "Gregório: Sorry, Jorge! Im stronger fighting on my own. I need to get stronger and for this i can't help you. Forgive me, Jorge.", 
        "Jorge, the squirrel: Its alright, my friend. I understand. At least i will die with dignity. Good bye, Greg"],
    "area4BFinal":["Gregório killed all the enemies and now Gregório is powerfull.","It costed Jorges life, was it worth it?", 
        "Gregório completed the Friendship Conflict, Gregório received the Friendship Stone."],

    "final_area":["you area ugly", "i hate you","choose wisely","fight"] },

    

    {"initial_area":["Gregório: Onde eu estou? O que estou fazendo aqui? Será que estou sonhando?",
        ".....",".....",
        "Esta é a mente de Gregório.", "Ele está em conflito consigo por conta de decisões que tem que tomar.",
        "Para encontrar paz consigo, ele precisa enfrentar estes conflitos. Para fazer isso ele deve coletar 4 Pedras do Conflito (Conflict Stones).", 
        "Pedra do Amor, Pedra da Família, Pedra do Espírito, Pedra da Amizade.", "O caminho esquerdo roxo leva a Área do Conflito do Amor.", 
        "O caminho azul de cima leva a Área do Conflito da Família.", "O caminho da direita verde leva a Área do Conflito do Espírito.",
        "O caminho laranja de baixo leva a Área do Conflito da Amizade.", 
        "Enfrente os conflitos e pegue as 4 pedras e volte aqui para fazer com que o Gregório faça paz consigo.", 
        "Use WASD para mover Gregório e 'F' para atacar, aquela barra no canto superior esquerdo é o HP de Gregório.", 
        "Se a qualquer momento Gregório ficar preso dentro do sonho, aperte o botão de pânico no canto superior direito para reiniciar o sonho, obrigado.",
        ".....",".....",
        "Gregório: O que será que eu vou encontrar ao fim de cada caminho?"],
        
    "mind_area1":["Namoro há tanto tempo que nem me lembro mais como é ser solteiro.",
        "Depois de 8 anos namorando, sem perspectiva de mudanças, nem de planos a longo prazo, não sei se continuar nesse relacionamento é o melhor para mim.",
        "Eu amo a minha namorada. Sempre tivemos um relacionamento bom e tranquilo, mas essa rotina na qual estamos presos e a falta de emoção no nosso relacionamento estão me fazendo repensar se é isso o que eu quero para a minha vida.",
        "Sou tão novo e sinto que não vivi experiências suficientes para a minha idade.",
        "Sair para balada com os amigos. Poder conhecer garotas novas. Será que isso vai preencher a necessidade que eu estou sentindo?",
        "Será que é isso mesmo o que eu quero? Ou será que o que realmente está faltando é conversa e comprometimento no meu atual namoro?"],

    "area1":["Giovana: Sniff sniff", "Giovana: Não acredito que você está pensando em terminar comigo, amor! Eu te amo tanto! Não faz isso comigo, por favor. Prometo que nós vamos melhorar.",
        "Greg: Como você descobriu que eu estava pensando nisso? Eu nunca te disse nada sobre isso!",
        "Seus atos, Greg. Suas ações te entregaram, meu amor. Por favor, não desiste da gente! Nós vamos casar, Gregório. Anote o que eu estou te dizendo. Nós vamos casar. Lute pelo nosso amor, Greg."],
    "area1A":["Gregório recebeu a Espada do Amor, essa é a espada mais forte no mundo dos sonhos.", 
        "Greg: Você está certa, amor. Vou lutar por nós. Não quero viver sem você.",
        "Giovana: Então venha e lute por mim. Se você conseguir me derrotar, ficaremos juntos para sempre."],
    "area1AFinal":["Gregório completou o Conflito do Amor, Gregório recebeu a Pedra do Amor.", 
        "Giovana: Eu te amo, amor. Vamos ficar juntos para sempre. Tenho certeza disso."],
    "area1B":["Gregório recebeu a Capa da Liberdade, agora ele pode usar dash apertando 'shift'.", 
        "Giovana: Você não pode fazer isso comigo, Greg! Eu preciso de você.",
        "Giovana: Você não vai conseguir fugir de mim, Gregório. Eu vou te achar onde quer que você esteja.",
        "Giovana: Vou te perseguir para sempre, amor. Eu te odeio por me fazer passar por isso.",
        "Giovana: Nós vamos ser felizes junto. Eu te prometo que vamos."],
    "area1BFinal":[ "Giovana: Eu desisto! Não aguento mais sofrer por você. Você está certo, Greg.",
        "Giovana: Não consigo me lembrar qual foi a última vez que nós fomos verdadeiramente felizes juntos. Acho que insistir no erro é realmente burrice. Vou te deixar em paz, Greg. Tchau. Quem sabe nos esbarramos por aí algum dia.",
        "Gregório completou o Conflito do Amor, Gregório recebeu a Pedra do Amor."],
    
    "mind_area2":["Meus pais sempre foram de brigar muito. Cresci entre suas constantes brigas e desentendimentos, então nada disso é novidade para mim. Com o tempo, acabei aprendendo a lidar com a situação e acho que sair de casa me ajudou muito nesse processo.",
        "Recentemente, as coisas começaram a piorar consideravelmente. O que eram brigas semanais,  acabaram se transformando em brigas diárias. Ninguém em sã consciência consegue viver do jeito que os meus pais estão vivendo e continuar são."],

    "area2":["Mãe: Gregório,  seu pai e eu conversamos muito e decidimos que nós vamos nos divorciar. Não aguentamos mais brigar e achamos que assim vai ser melhor para todo mundo.",
    "Gregório: Isso é sério?", "Pai: Sim, filho. Devíamos ter tomado essa decisão muitos anos atrás.", 
    "Gregório: Que bom, pai. Fico feliz por vocês. Sinceramente, acho que se divorciar é a melhor coisa que vocês podem fazer.",
    "Mãe: Sim, querido. Concordo com você. Agora só resta você decidir de que lado você vai ficar.",
    "Gregório: O quê? Como assim?", "Pai: Você tem que escolher qual de nós dois você quer continuar vendo, meu filho. Você não pode ter os dois, Gregório. É ou um ou o outro."],
    "area2A":["Pai: Não acredito que você fez isso comigo, meu filho. Nunca vou te perdoar por isso. Enfrente o meu exército ou morra, Gregório."],
	"area2AFinal":["Gregório completou o Conflito da Família, Gregório recebeu a Pedra da Família.","Mãe: Que bom que você me escolheu, meu filho. Vamos embora que a mamãe vai fazer o bifinho com batata frita que você tanto ama."],
    "area2B":["Gregório recebeu a Poção da Vida, agora você tem mais HP","Mãe: Você não pode fazer isso com a gente, Gregório. Como você vai conseguir viver sabendo que deixou os seus pais para trás por livre e espontânea vontade?",
        "Gregório: Eu não seria capaz de escolher entre vocês. Nunca vou conseguir perdoa-los por me colocarem nessa situação. Vocês são loucos.",
        "Gregório completou o Conflito da Família, Gregório recebeu a Pedra da Família.",
        "Mãe: Não acredito que você fez isso comigo, meu filho. Eu te alimentei, Gregório. Eu te criei.  Nunca vou te perdoar por isso. Enfrente o meu exército ou morra, Gregório."],
    "area2BFinal":["Gregório completou o Conflito da Família, Gregório recebeu a Pedra da Família.", "Pai: Vamos tomar um Chopp, meu filho. É por minha conta."],

    "mind_area3":["Na vida, nem sempre as coisas são “preto no branco”. Muitas vezes não existe certo ou errado, mas sim decisões a serem tomadas e as suas consequências.",
        "Escolher o caminho mais fácil não é necessariamente errado. Optar por não ter tanto trabalho ou problemas pode te poupar de muita dor de cabeça.",
        "Sim, talvez isso retarde um pouco o seu amadurecimento e diminua as suas forças para enfrentar os problemas que surgirem no caminho, mas isso não quer dizer que a vida não vai dar um jeito de te ensinar isso um dia.",
        "Provavelmente o caminho mais difícil vai trazer consigo uma bagagem maior. Uma sensação indescritível de “eu fiz tudo o que estava ao meu alcance”.",
        "Não há nada melhor do que ver seus esforços serem recompensados  e ter a sensação de dever cumprido após uma longa e cansativa jornada. Mas será que isso vale a pena? Será que poupar esforço, a longo prazo, não é a melhor decisão a se tomar?"],

    "area3":["Tudo é escuro aqui na área da escuridão, tome uma tocha para te ajudar.",
        "As vezes você pode escolher entre o caminho fácil e o caminho difícil.",
        "O caminho que Gregório seguir, vai definir quem ele é.", "Lembre-se, não existe decisão correta, mas simplesmente uma decisão.", 
        "Qual caminho Gregório deve seguir?"],
    "area3A":["Você escolheu o caminho fácil.", "Vá para a porta de cima."],
    "area3AFinal":["Gregório recebeu as Botas da Velocidade, elas farão Gregório se mover mais rápido.", 
        "Gregório completou o Conflito do Espírito, aqui está o prêmio", "Gregório recebeu a Pedra do Espírito."],
    "area3B":["Você escolheu o caminho difícil.", "Por esse caminho, Gregório deve entrar no Labirinto do Espírito, encontrar 3 chaves e abrir a por no fim do labirinto para completar o conflito.", 
        "Vá para a porta de baixo."],
    "area3BFinal":["Gregório recebeu a Poção do Tempo, beba e Gregório será capaz de deixar o tempo mais lento por um curto período, aperte 'E' para usar o seu poder",
        "Gregório completou o Conflito do Espírito.","Gregório recebeu a Pedra do Espírito."],

    "mind_area4":["A amizade é algo fundamental para qualquer pessoa. São os amigos que, em conjunto com a família,  nos moldam como pessoas e são eles que estão presentes nos nossos melhores e piores momentos.",
        "Porém, às vezes os amigos nos decepcionam. Quantas vezes eu já achei que podia contar com uma pessoa e acabei quebrando a cara com isso",
        "Alguns amigos são para sempre. Outros são temporários. Já alguns nunca foram seus amigos de verdade.",
        "Como identificar quando uma amizade é verdadeira? Quando devemos ser egoístas e dar preferência para o que é melhor para nós? Quando devemos dar prioridade para os nossos amigos?"],

    "area4":["Jorge, o esquilo: Greg, me ajuda, por favor! Estou sem armas e não consigo me defender sozinho.",
        "Gregório: Mas eu vou morrer se eu me jogar aí no meio, Jorge", 
        "Jorge, o esquilo: Não vai, não. Eu te dou cobertura, amigo. Pode acreditar em mim. Você sabe que pode contar comigo, não sabe?",
        "Proteger Jorge ou deixa-lo morrer e matar os inimigos em trocar de mais poder?"],
    "area4A":["Gregório recebeu o Escudo da Amizade, aperte 'R' para usa-lo, ele deixa o Gregório invencivel por 5 segundos, mas deixa ele mais devagar.",
        "Gregório: Seja o que Deus quiser. Não saia de perto de mim, Jorge. Eu te protejo."],
	"area4AFinal":["Gregório completou o Conflito da Amizade, Gregório recebeu a Pedra da Amizade.", "Obrigada, meu amigo. Nunca esquecerei o que você fez por mim. Precisando, é só falar. Estarei aqui para o que você precisar."],
    "area4B":["Gregório recebeu o Cajado da Podridão, aperte 'R' para usa-lo, ele atira bolas de veneno que causam dano ao longo do tempo no inimigos.",
        "Gregório: Desculpa, Jorge! Sou mais forte lutando sozinho. Preciso ficar mais forte e pra que isso aconteça não posso ajuda-lo. Me perdoe, Jorge.", 
        "Jorge, o esquilo: Tudo bem, amigo. Eu entendo. Pelo menos morrerei com dignidade. Adeus, Greg"],
    "area4BFinal":["Gregório matou todos os inimigos e agora é mais forte","Isso custou a vida de Jorge. Valeu a pena?", 
        "Gregório completou o Conflito da Amizade, Gregório recebeu a Pedra da Amizade."],

    "final_area":["you area ugly", "i hate you","choose wisely","fight"]}

]

